_notes/2022-07-17-fio-spdk.html
---
layout: post
title: "Notes: Setting up fio for SPDK"
short: "Setting up fio for SPDK"
status: Stale
---

<div id="outline-container-org71ca356" class="outline-2">
<h2 id="org71ca356"><span class="section-number-2">1.</span> !!!This page requires cleaning!!!</h2>
</div>

<div id="outline-container-org87098c1" class="outline-2">
<h2 id="org87098c1"><span class="section-number-2">2.</span> Setup FIO For SPDK in steps</h2>
<div class="outline-text-2" id="text-2">
<p>
Setting up fio for SPDK is at the moment not a fun experience. It involves issues with linking, paths and segfaults.
The following works (on my machine):
</p>

<ol class="org-ol">
<li>Clone SPDK RECURSIVELY (follow <a href="https://spdk.io/doc/getting_started.html">https://spdk.io/doc/getting_started.html</a>)</li>
<li>Be sure to setup all pkgdeps in the spdk repo not just a few</li>
<li>Clone fio anywhere (<a href="https://github.com/axboe/fio">https://github.com/axboe/fio</a>)</li>
<li>move to fio directory</li>
<li>call  `./configure` in the fio directory (not specified but absolutely necessary!)</li>
<li>call `make -j $nprocs` in fio directory</li>
<li>call `sudo make install` IF fio needs to be installed</li>
<li>move to spdk directory again</li>
<li>call `./configure &#x2013;with-fio=&lt;absolute path to earlier installed fio repo&gt;` inside SPDK dir. Do NOT use a relative path.</li>
<li>call `make -j` in SPDK dir</li>
<li><p>
when running fio with SPDK plugin only this worked for me&#x2026;:
</p>
<div class="org-src-container">
<pre class="src src-bash">    <span style="color: #ECBE7B;">sudo</span> <span style="color: #dcaeea;">LD_LIBRARY_PATH</span>=&lt;SPDK_DIR&gt;/build/lib <span style="color: #dcaeea;">LD_PRELOAD</span>=&lt;SPDK_DIR&gt;/build/fio/spdk_nvme fio
</pre>
</div></li>
</ol>

<p>
In order to use ZNS devices for SPDK do:
</p>

<ol class="org-ol">
<li><p>
Get NVMe trid:
</p>
<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #dcaeea;">trid</span>=<span style="color: #ECBE7B;">ls</span> -l /sys/block/$<span style="color: #dcaeea;">dev</span>/device/device | awk <span style="color: #98be65;">'{split($11,dev,"/"); print dev[4]}'</span><span style="color: #51afef; font-weight: bold;">`</span>
</pre>
</div></li>
<li><p>
ONLY bind this trid (really why is the default binding to use all devices?):
</p>
<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #dcaeea;">PCI_ALLOWED</span>=$<span style="color: #dcaeea;">trid</span> &lt;SPDK_DIR&gt;/scripts/setup.sh
</pre>
</div></li>
<li><p>
Move trid to dot separated instead of colon&#x2026; (required by fio)
</p>
<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #dcaeea;">triddot</span>=$<span style="color: #51afef;">(</span><span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">trid</span> | sed <span style="color: #98be65;">'s/\:/./g'</span><span style="color: #51afef;">)</span>
</pre>
</div></li>
<li><p>
Call the following to run with ZNS:
</p>
<div class="org-src-container">
<pre class="src src-bash">       <span style="color: #ECBE7B;">sudo</span> <span style="color: #dcaeea;">LD_LIBRARY_PATH</span>=&lt;SPDK_DIR&gt;/build/lib <span style="color: #98be65;">\</span>
           <span style="color: #dcaeea;">LD_PRELOAD</span>=&lt;SPDK_DIR&gt;/build/fio/spdk_nvme <span style="color: #98be65;">\</span>
           fio <span style="color: #dcaeea;">filename</span>=<span style="color: #dcaeea;">trtype</span>=PCIe <span style="color: #dcaeea;">traddr</span>=$<span style="color: #dcaeea;">triddot</span> <span style="color: #dcaeea;">ns</span>=<span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #dcaeea;">ioengine</span>=spdk <span style="color: #dcaeea;">thread</span>=<span style="color: #da8548; font-weight: bold;">1</span>
</pre>
</div>
<p>
^^ For this remember ns is 1-indexed for unexplained reasons in fio<sub>spdk</sub>, not 0-indexed&#x2026; probably add +1 to your nsid. Also always use thread=1, SPDK does not work with multiple processes, requiring thread parallelism instead.
</p></li>
</ol>
</div>
</div>
